package main

import "fmt"

func main() {
	/*
	初始化数组:
		1.var a [5]int = [5]int{1,2,3,4,5}
		2.自动推导   b := [6]int{1,2,3,4,5,6}
			21.元素个数可以少于长度，默认会用0补全
				但是不能多于长度
			22.初始化的时候不指定长度,用...代替
				g := [...]int{1,2,3,6,7,9}
			23.指定某个元素初始化：下标为1的值为10，下标为3的值为20，其他的用0补全
				f := [5]int{1:10,3:20}
	 */

	var a [5]int = [5]int{1,2,3,4,5}
	fmt.Println(a)

	b := [6]int{1,2,3,4,5,6}
	fmt.Println(b)

	e := [4]int{1,2,3}
	fmt.Println(e)

	// 下标为1的值为10，下标为3的值为20，其他的用0补全
	f := [5]int{1:10,3:20}
	fmt.Println(f)

	// 初始化的时候不指定长度,用...代替
	g := [...]int{1,2,3,6,7,9}
	fmt.Println(len(g))

}
